/* • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •
• • • • • JavaScript необходимые основы для начинающих • • • • •
• • • • • • • • • • • • практический курс • • • • • • • • • • •
• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •
• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • */
// ================== 0. Настройка окружения ===============
/*
- Установка редактора
- Установка плагина liveServer
- Моя тема Ayu
- Создание проекта
*/

// =================== 1. Подключение ===================
/*
- index.html
- файл main.js
- тег <script src></script>
- Запуск в liveServer
- команда console.log для вывода информации в консоль браузера
- комментарии
*/

// console.log('Hello, from JS') 

// ====================2. Переменые============

// let userName = 'Aleks'
// console.log(userName)

// ===============2.1 Типы переменных.============
//Новый стандарт ES 6 
//let - переменная 
//const - константа 

//Старый стандарт ES 5 
//var - переменная 


//let - может менять значение во время работы программы 
// let userName = 'Aleks'
// console.log(userName)
// userName = 'Egor'
// console.log(userName)


//const - не может менять значение 
// const yearOfBirth = 1984
// const p = 3.14

/* ---------------------------*/
// let name, age;

// name = 'Yrij';

// const profession; // Ошибка Значение должно быть задано сразу 

// var - старый формат обьявления переменных ES5
//в отличии от let и const var имеет функциональную область видимости а не блочную 

// var city = 'Kiyv'
// city = 'Zaporizhzhy'
// city = 'Berdynsk'
// console.log(city)

// function sum () {
//     var userName = 'Valera'
//     console.log(userName)
// }
// sum()
// console.log(userName)

// =============2.1 Типы переменных =================

// {
//     let userName = 'Kiril'
//     console.log(userName)
// }
// console.log(userName)

// !по умолчанию используем const
// Когда явно понятно что переменная будет менять свое значение мы используем let



